app/controllers/buildings_controller.rb

  def show
    building_id = params[:id]
    @building = Building.find_by_id(building_id)
    @rooms = Room.where(:building_id => building_id)
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."building_id" = $1  [["building_id", 2]]